[
 {
  "Title": "Chicken Pot Pie Recipe",
  "Synopsis": "If you’re craving comfort food, warm homemade chicken pot pie always hits the spot. This completely from-scratch recipe features a double buttery, flaky pie crust encasing tender chicken and vegetables in a rich and creamy sauce. Watch the video tutorial to see how it comes together!“This is the new celebration meal, favorite meal, go-to meal \u0026 just-because meal in my house. Everyone loves this!! I make it exactly as written. The crust is legendary and I’ve used it for all crust-requiring recipes. I’ve also passed this recipe to my friends, and equally glowing reviews from them. ★★★★★”“This is SO incredibly good. I followed the recipe to the T (including the pie crust recipe, which was my first time making pie crust ever) and it came out absolutely perfect. As always, your instructions are so clear and your recipe is perfect!… “This double crust chicken pot pie is perfect when you’re looking for cold weather comfort food. Check out the step-by-step photos above, as well as my Notes at the end of this recipe.Keywords: chicken pot pie",
  "Prep": {
   "Author": "Author: Sally",
   "PrepTime": "Prep Time: 2 hours, 50 minutes",
   "CookTime": "Cook Time: 35 minutes",
   "TotalTime": "Total Time: 3 hours, 25 minutes",
   "Yield": "Yield: serves 8"
  },
  "Description": "",
  "Ingredients": {
   "Ingredients": [
    "Homemade Pie Crust or All Butter Pie Crust (both recipes make 2 crusts, 1 for bottom and 1 for top)",
    "1 pound (450g) skinless boneless chicken breast or thighs, cubed",
    "1 cup (about 130g) sliced carrots (about 2 carrots)",
    "1/2 cup (about 40g) sliced celery",
    "1/3 cup (5 Tbsp; 71g) unsalted butter",
    "1/3 cup (45g) chopped yellow onion (1/2 of a small onion)",
    "1 teaspoon minced garlic",
    "1/3 cup (41g) all-purpose flour",
    "3/4 teaspoon salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 teaspoon dried thyme leaves",
    "1 and 3/4 cups (420ml) chicken broth/stock (I recommend reduced sodium)",
    "2/3 cup (160ml) half-and-half*",
    "1 cup (125g) frozen peas",
    "egg wash: 1 large egg beaten with 1 Tablespoon (15ml) milk",
    "optional: sprigs of fresh thyme for garnish"
   ]
  },
  "Instructions": {
   "Instructions": [
    "The crust: Prepare either pie crust recipe through step 5, including chilling for at least 2 hours. I usually make the crust the night before. The pie crust recipe makes 2 crusts and you’ll be using both crusts.",
    "In a large pot, combine chicken, carrots, and celery. Add enough water to cover the chicken and vegetables, then place over medium-high heat. Bring to a boil, then allow to boil for 10 minutes. Remove from heat, drain, and set aside.",
    "In a large skillet over medium heat, combine the butter, onions, and garlic. Stirring occasionally, cook until the onions are translucent and the butter is lightly browning. Whisk in the flour, salt, black pepper, thyme, chicken broth, and half-and-half. Cook and whisk until no flour lumps remain, then simmer over medium-low heat until thick. I simmer mine for 10 minutes. You want it to be a very thick gravy; simmer longer if necessary. Taste and add more seasonings if you prefer. Sometimes I add more thyme. Remove from heat and set aside.",
    "Preheat oven to 425°F (218°C).",
    "After the pie dough has chilled: On a floured work surface, roll out one of the discs of chilled dough (keep the other one in the refrigerator). Turn the dough about a quarter turn after every few rolls until you have a circle about 12 inches in diameter. Carefully place the dough into a 9-inch pie dish that’s 1.5–2 inches deep. Tuck the dough in with your fingers, making sure it is smooth. With a small sharp knife or kitchen shears, trim the extra overhang of dough and discard.",
    "Spoon the chicken and vegetable mixture into the crust. Scatter the frozen peas on top. Pour/spread the gravy evenly over top.",
    "Roll out second half of pie crust dough just as you did the first. Cover the pie with the second crust and trim the extra overhang off the sides. Crimp the pie crust with a fork to seal the edges. With a small sharp knife, slice a few small slits in the top crust to allow steam to escape. Using a pastry brush, brush crust and edges with egg wash.",
    "Bake for 32–38 minutes or until the top of the crust is golden brown. After 20 minutes of baking, be sure to cover the edges of the crust with aluminum foil or use a pie crust shield to prevent the edges from getting too brown. (See this post on the best pie baking tools for instructions on how to make a pie crust shield out of foil.)",
    "Remove from the oven and cool for at least 10 minutes before serving. Makes amazing leftovers—the filling is so thick on the next day! Reheat as desired. Leftovers keep well in the refrigerator in an airtight container for up to 5 days."
   ]
  }
 }
]